{
    "projects":[
        {
            "type": "game",
            "name": "Ninjas On Trampolines",
            "coverImage": "./img/Ninjas_Logo_Tranparent.png",
            "trailer": "",
            "timeSpent": "August 2023 - Present",
            "role": "Technical Artist / Marketing Lead",
            "overview": "&emsp;Ninjas on Trampolines is a physics-based platform fighter where players play as Ninjas that can paint their own colors on the wall. The objective of the game is to have the most of your own color on the back wall by the end of a match, which can be done by smacking other players or using a spray can to graffiti the background. <br>&emsp;The game features three different game modes: Free-for-All, Spray King, and Paintball. Each gamemode takes a twist on the simple, yet extremely captivating game loop of Free-for-All by introducing new objectives for players. Paintball has players chase a soccer ball-like object, while Spray King has players chase another player holding an item that gives them an advantage.",
            "goals": "",
            "responsibilities": "&emsp;During the first few months of development, my main priority was to get a working paint system and refining it to be more visually pleasing. There were other minor tasks as setting up the basic movement system, animations, and UI. <br><br>&emsp;For the initial paint shader I followed two videos on their take of Splatoon's paint effect, taking notes on how they setup a system using both shader code and graph to setup a basic mask over any texture that they would want to get painted. After getting an inital version of the paint done, players would be able to get their paint onto the background with circles being shown where they killed an opponenet. After showing off the game a suggestion that we took was to make the paint be based off velocity which would make the paint seem more dynamic as the shape and length would be different for each kill. By the end of the 3rd milestone I had implemented and worked on basic scene transitions of a fade in/out, sound effects, music, and a small edits to the paint shader.<br><br>&emsp;After the third milestone I would further work on the paint shader making slight improvements from its initial version by adding the use of premade textures, as well as changing the look of the velocity based paint, by scaling the texture according to the speed of the attack instead of painting multiple versions of the splatter onto the background. <br><br>&emsp;I had also started to work on implementing a basic post process shader to aid players that may have forms of color blindness. While the shader is still a work in progress there is a filter for the three most common types being protanopia, tritanopia, and deuteranopia. There are still some small things that need to be addressed with some colors being too close together. Since there are eight colors available to the players to use so there will be an issue with some colors being too similar to each other. I tried addressing this by adding a contrast filter to try and make the difference betweent the colors even greater and adding a pattern filter so that there are three different patterns that get layered on top of certain player's paint to give it some extra texture. While these are not ''perfect'', it is something that the team has come to acknowledge, so that if someone who would like to play our game has color blindness, this filter would help in differentiating the colros for the player.",
            "retrospect": "",
            "engine": "Unity",
            "tools": "C#, HLSL, Shader Graph, Visual Effects Graph",
            "link":"",
            "imageGallery":[
                {
                    "url":"./img/Ninjas_Logo_Tranparent.png",
                    "subtitle":"Logo"
                },
                {
                    "url":"./img/ninjas/ninjas-gameplay.gif",
                    "subtitle":"Gameplay"
                },
                {
                    "url":"./img/ninjas/firstpaint.gif",
                    "subtitle":"First iteration of paint shader"
                },
                {
                    "url":"./img/ninjas/secondpaint.gif",
                    "subtitle":"Second iteration of paint shader"
                },
                {
                    "url":"./img/ninjas/currentpaint.gif",
                    "subtitle":"Current iteration of paint shader"
                },
                {
                    "url":"./img/ninjas/colorfilter.gif",
                    "subtitle":"Color filter for the 8 player colors"
                }
            ]
        },
        {
            "type": "game",
            "name": "Nebulicious",
            "coverImage": "https://raw.githubusercontent.com/scc8371/scc8371.github.io/main/media/nebulicious/nebulicious.gif",
            "trailer": "",
            "timeSpent": "10 Days",
            "role": "Technical Artist",
            "overview": "&emsp;Nebulicious is a prototype of a casual cooking game with the twist of using two separate movement options to gather ingredients and cook donuts. The project was made for the Society of Play's Hexcode Jam 3, which required us to use a specific color palette named 'Hot Panda'.",
            "goals": "",
            "responsibilities": "&emsp;Durign the prototype development of Nebulicious, I was responsible for the shaders, visual effects, setting up the character animations, and simple 3D modeling. <br><br>&emsp;I've started to become more accustomed with Unity's Visual Effects Graph system. I definitely had more flexibility when using shader graphs for the particles, making it easier for myself to customize the look of the effect. With this I feel that I have been a little more creative with what I made and making the things I made a little unique. <br><br>&emsp;I'm happy with how this game turned out, given the 10-day time limit. I plan to continue working on this game, depending on how members of the team feel about it. There are still improvements that I would like to do on the current shaders within the game as well as try to make a shader for a procedurally generated planet to give some detail to it.",
            "retrospect": "",
            "engine": "Unity",
            "tools": "C#, Shader Graph, Blender, Visual Effects Graph",
            "link":"",
            "imageGallery":[
                {
                    "url":"https://raw.githubusercontent.com/scc8371/scc8371.github.io/main/media/nebulicious/neb_title.png",
                    "subtitle": "Menu Screen"                    
                },
                {
                    "url":"https://raw.githubusercontent.com/scc8371/scc8371.github.io/main/media/nebulicious/nebulicious.gif",
                    "subtitle": "Gameplay"
                },
                {
                    "url":"https://raw.githubusercontent.com/scc8371/scc8371.github.io/main/media/nebulicious/neb_sceneView.png",
                    "subtitle": "Game scene setup"
                },
                {
                    "url":"./img/vfx/rocketsmoke.gif",
                    "subtitle": "Rocket smoke VFX"
                },
                {
                    "url":"./img/vfx/greasebubble.gif",
                    "subtitle":"Grease plane & bubbles"            
                }
            ]
        },
        {
            "type": "game",
            "name": "PROJECT: Gladiator",
            "coverImage": "./img/gladiator/swordattack.gif",
            "trailer": "",
            "timeSpent": "September 2024 - Present",
            "role": "",
            "overview": "&emsp;Project: Gladiator is a two-player co-op game where players will fight against each other in a 2v2 style combat where duos have to cooperate in combat. Communication and synergy are the most important to win and survive these fights. Matches will consist of 4 pairs entering the arena, which will resemble the Colosseum. This game takes inspiration from the movie Gladiator with the main gimmick coming from games like Chained Together and Bred & Fred. While much of the basic combat will feel close to that of Souls games like Elden Ring and Dark Souls. <br>&emsp;Players will not be able to move a certain distance from each other, including movements like backstepping and rolling. All the actions will take place from a third-person perspective. The combat will act similarly to a souls-like combat system, with heavy and light attacks and combos for each.",
            "goals": "",
            "responsibilities": "&emsp;I am the sole developer of this project and developed every feature. I took inspiration from souls like games for the combat system while trying to keep a co-op focused game with the chain attached to each player. The players will start in different parts of the arena where only the last remaining team that is left alive will become the victor of the gladiator fight. I want these fights to feel similar to that of the scenes within the first Gladiator movie where we see Maximus have his first gladiator fight. <br>&emsp; Co-op games like It Takes Two, Chained Together, and Bread and Fred, which this game took inspiration from. I found that games such as these were popular with content creators while they were fun to watch, seeing the stress and frustration is what I found fun to watch from any streams or short videos I would see of those games.", 
            "retrospect": "",
            "engine": "Unity",
            "tools": "C#, Shader Graph, Visual Effects Graph",
            "link":"",
            "imageGallery":[
                {
                    "url":"./img/gladiator/swordattack.gif",
                    "subtitle": "Menu Screen"                    
                },
                {
                    "url":"./img/gladiator/backstep.gif",
                    "subtitle": "Menu Screen"                    
                }
            ]
        },
        {
            "type": "game",
            "name": "Olympus Interactive Site",
            "coverImage": "./img/olym/site.png",
            "trailer": "",
            "timeSpent": "May 2024 - August 2024",
            "role": "Web Designer",
            "overview": "&emsp;This website is a side-project of mine  to allow my small group of developers to have a homepage for our work. It was designed in a short time and was an oppurtunity for me to polish on by web design skills with Figma.",
            "goals": "",
            "responsibilities": "&emsp;I was responsible for the design the page. I utilized Figma, to design and framework a basic website to showcase the project that my group has worked on. I mainly did the design work, while the main developer worked on the site.",
            "retrospect": "",
            "engine": "",
            "tools": "Figma",
            "link":"",
            "imageGallery":[
                {
                    "url":"https://raw.githubusercontent.com/scc8371/scc8371.github.io/main/media/olympussite/olympussite_mockup.png",
                    "subtitle":"Landing Page and Project"
                },
                {
                    "url":"./img/olym/team.png",
                    "subtitle":"Team Section"
                },
                {
                    "url":"./img/olym/services.png",
                    "subtitle":"Servies Section"
                },
                {
                    "url":"./img/olym/aboutus.png",
                    "subtitle":"About Us Section"
                },
                {
                    "url":"./img/olym/contact.png",
                    "subtitle":"Contact and Footer Section"
                }
            ]
        },
        {
            "type": "showcase",
            "name": "VFX",
            "coverImage": "./img/vfx/slashnew.gif",
            "trailer": "",
            "role": "",
            "overview": "&emsp;A collection of different VFX that were made in Unity using the Universal Render Pipeline, shader graph, and visual effects graph.",
            "goals": "",
            "responsibilities": "",
            "retrospect": "",
            "link":"",
            "imageGallery":[
                {
                    "url":"./img/vfx/slashnew.gif"
                },
                {
                    "url":"./img/vfx/stylizedexplosion.gif"
                },
                {
                    "url":"./img/vfx/kamehameha.gif"                    
                },
                {
                    "url":"./img/vfx/rocketsmoke.gif"
                },
                {
                    "url":"./img/vfx/fracture.gif"                    
                },
                {
                    "url":"./img/vfx/greasebubble.gif"                    
                }
               
               
            ]
        },
        {
            "type": "showcase",
            "name": "Shaders",
            "coverImage": "./img/shaders/cel-shading.gif",
            "trailer": "",
            "role": "",
            "overview": "&emsp;A collection of different shaders that were made in Unity using the Universal Render Pipeline shader graph.",
            "goals": "",
            "responsibilities": "",
            "retrospect": "",
            "link":"",
            "imageGallery":[
                {
                    "url":"./img/shaders/auroraborealis.gif"
                },
                {
                    "url":"./img/shaders/cel-shading.gif"
                },
                {
                    "url":"./img/shaders/spaceskybox.png"                    
                },
                {
                    "url":"./img/shaders/daynightskybox.gif"                    
                },
                {
                    "url":"./img/watershaders/water.gif"
                },
                {
                    "url":"./img/watershaders/ocean.gif"
                }                    
               
            ]
        },
        {
            "type" : "links",
            "name": "Game Design Documents",
            "coverImage": "./img/document.png",
            "trailer": "",
            "role": "",
            "overview": "&emsp;Here are any game design documents that I have worked on or hope to eventually start.",
            "goals": "",
            "responsibilities": "",
            "retrospect": "",
            "links":[
                {
                    "title" :"PROJECT: Gladiator Design Document",
                    "date" : "Sept 2024 - Present",
                    "link" : "https://docs.google.com/document/d/1JScY-xs7dM5bUklUMA1yvLFyu49hAWLyfzrCwvNkT4s/edit?usp=sharing"
                },
                {
                    "title" :"Ninjas on Trampolines Design Document",
                    "date" : "Sept 2023 - Present",
                    "link" : "https://docs.google.com/document/d/1VzbaXHNuhw9445c2Qm5PXf4R0Jn5yNRlm7IDgVhKtI4/edit?usp=sharing"
                },
                {
                    "title" :"Gate Crash Design Document",
                    "date" : "Dec 2022 - Present",
                    "link" : "https://docs.google.com/document/d/1IjDalesYixSGFHQ4QxXLbGa-aZ6wMr9p-DpiheLY6rM/edit?usp=sharing"
                },
                {
                    "title" :"Nebulicious Design Document",
                    "date" : "2 Weeks",
                    "link" : "https://docs.google.com/document/d/1Ek1YsNrmnBxao7xPV4B0l6KNCt-yG7aMEzFaVddeYqg/edit?usp=sharing"
                },
                {
                    "title" :"Helpless Design Document",
                    "date" : "1 Week",
                    "link" : "https://docs.google.com/document/d/18OGNfsIwT99Oo75fd28T4Td8Qt6gd3dOsU3-HkybI4U/edit?usp=sharing"
                },
                {
                    "title" :"Changeling VR Technical Art Documentation",
                    "date" : "May 2023 - Aug 2023",
                    "link" : "https://docs.google.com/document/d/1E7ptMnWlWz28l1a6cuzR2rM1qOa7uT93ywZbXIzBtXM/edit?usp=sharing"
                }
            ],
            "imageGallery":""
        }
    ]
}